brew "act"
brew "bat"
brew "eza"
brew "fzf"
brew "node"
brew "gemini-cli", link: false
brew "gh"
brew "lazygit"
brew "luarocks"
brew "neovim"
brew "protobuf"
brew "python-tk@3.14"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "uv"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh"
vscode "anyscalecompute.ray-distributed-debugger"
vscode "charliermarsh.ruff"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
flatpak "app.zen_browser.zen"
flatpak "com.discordapp.Discord"
flatpak "com.github.PintaProject.Pinta"
flatpak "com.github.rafostar.Clapper"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.mastermindzh.tidal-hifi"
flatpak "com.mattjakeman.ExtensionManager"
flatpak "com.slack.Slack"
flatpak "com.spotify.Client"
flatpak "com.todoist.Todoist"
flatpak "com.transmissionbt.Transmission"
flatpak "com.unity.UnityHub"
flatpak "com.valvesoftware.Steam"
flatpak "io.github.flattool.Ignition"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.nokse22.high-tide"
flatpak "io.github.wivrn.wivrn"
flatpak "io.gitlab.adhami3310.Impression"
flatpak "io.missioncenter.MissionCenter"
flatpak "org.gnome.Calculator"
flatpak "org.gnome.Calendar"
flatpak "org.gnome.Characters"
flatpak "org.gnome.Connections"
flatpak "org.gnome.Contacts"
flatpak "org.gnome.DejaDup"
flatpak "org.gnome.FileRoller"
flatpak "org.gnome.Firmware"
flatpak "org.gnome.Logs"
flatpak "org.gnome.Loupe"
flatpak "org.gnome.Maps"
flatpak "org.gnome.NautilusPreviewer"
flatpak "org.gnome.NetworkDisplays"
flatpak "org.gnome.Papers"
flatpak "org.gnome.TextEditor"
flatpak "org.gnome.Weather"
flatpak "org.gnome.World.PikaBackup"
flatpak "org.gnome.baobab"
flatpak "org.gnome.clocks"
flatpak "org.gnome.font-viewer"
flatpak "org.mozilla.Thunderbird"
flatpak "org.mozilla.firefox"
flatpak "page.tesk.Refine"
flatpak "us.zoom.Zoom"
